Repository: Storik4pro/cdpiui
Catalog: CDPIUI/Strings/*/Resources.resw
Source language: en_us
Languages: ru

# ZoomReturnMenuItem.Text
source: Restore zoom by default
ru: Восстановить масштаб по умолчанию

# OpenListsConfigDirectory.Text
source: Open config site lists storage directory
ru: Открыть расположение списков сайтов этого пресета

# OpenBinsConfigDirectory.Text
source: Open config bin files storage directory
ru: Открыть расположение BIN-файлов этого пресета

# EditSitelistAskContentDialog.Title
source: How would you like to open this file?
ru: С помощью чего следует открыть этот файл?

# EditSitelistAskContentDialog.SecondaryButtonText
source: Cancel
ru: Отмена

# UseSystemDefaultApplication.Text
source: Follow system settings
ru: Следовать параметрам системы

# SelectApplicationManually.Text
source: Select application on this PC
ru: Выбрать приложение на этом ПК

# FileDialogChooseExecutable
source: Select the application executable file
ru: Выберите исполняемый файл приложения

# FileDialogChooseExecutableFilter
source: WIN32 Applications
ru: Приложения на архитектуре WIN32

# DoNotAskAgainCheckBox.Content
source: Don't ask me again
ru: Запомнить мой выбор

# ActionsTextBlock.Text
source: Actions
ru: Действия

# OpenComponentSiteListToEditCard.Header
source: Default application to edit component's site lists
ru: Приложение для изменения списков сайтов компонента

# OpenComponentSiteListToEditCardDescription
source: Now for edit used "{0}"
ru: Сейчас используется "{0}"

# FollowSystem
source: system choose
ru: системный выбор

# TroubleshootingWindowTitle
source: Troubleshooting
ru: Поиск и устранение неполадок

# TroubleshootinSettingsCard.Header
source: Troubleshooting
ru: Поиск и устранение неполадок

# TroubleshootingTitleTextBlock.Text
source: Troubleshooting
ru: Поиск и устранение неполадок

# TroubleshootingMainPageTitleTextBlock.Text
source: What does not work as planned?
ru: Что работает не так, как запланировано?

# NotOneConfigDoesWorkCard.Header
source: All configs not work to me
ru: Ни один пресет не позволяет получить доступ к необходимым сайтам

# MyProblemNotInListCard.Header
source: My problem is not on the list
ru: Моей проблемы нет в списке

# ComponentDoesNotRunCard.Header
source: Component constantly crashes with an error
ru: Компонент постоянно вылетает с ошибкой

# StoreCannotLoadCard.Header
source: I cannot open or download items from Store
ru: Я не могу открыть Магазин или скачать элемент из него

# ApplicationCannotDownloadUpdateCard.Header
source: Application cannot download/check for updates
ru: Приложение не может проверить/скачать обновления

# TroubleshootingWorkingTitle.Text
source: Diagnostics
ru: Диагностика

# TroubleshootingWaitTextBlock.Text
source: The command prompt window may flicker during the process.
ru: Производится диагностика вашей системы. Окно командной строки может мерцать в процессе.

# FixTextBlock.Text
source: Fixing
ru: Исправление

# FixTipTextBlock.Text
source: Working is currently underway on fixing your problems
ru: Ведется работа над устранением неполадок

# UpdateNowButton.Content
source: Update now
ru: Обновить сейчас

# VersionNotesTextBlock.Text
source: Version notes
ru: Заметки к выпуску

# ExclusiveGroupTextBlock.Text
source: Exclusive group
ru: Взаимоисключающая группа

# RemoveFileButton.ToolTipService.Tooltip
source: Remove File
ru: Удалить файл

# SelectFileText.Text
source: Select file
ru: Выбрать файл

# ViewSelectedFileButton.ToolTipService.ToolTip
source: Edit this file in default app
ru: Изменить этот файл в приложении по умолчанию

# ItemUnknownSourceWarningTextBlock.Text
source: This item is downloaded from unknown source and can potentially harm your computer. If you do not trust the source, do not install this item.
ru: Этот элемент был загружен из неизвестного источника и потенциально может нанести вред вашему компьютеру. Если вы не доверяете источнику, то не устанавливайте этот элемент

# SatusGettingPackInfo
source: Getting ready package
ru: Идет подготовка пакета

# Version
source: Pack version: {0}
ru: Версия пакета: {0}

# Source
source: Source: {0}
ru: Источник: {0}

# StoreSmallInstallItemName
source: Install {0}?
ru: Установить {0}?

# InstallButton.Content
source: Install
ru: Установить

# ItemAlreadyInstalledWarn
source: The latest version of this item is currently installed. To roll back the version, first uninstall that item in Store. ERR_STORE_LATEST_VERSION_ALREADY_INSTALLED
ru: Последняя версия этого элемента уже установлена. Чтобы произвести откат удалите этот элемент через Магазин вручную, после чего повторите попытку. ERR_STORE_LATEST_VERSION_ALREADY_INSTALLED

# ManualItemInstallationSettingsCard.Header
source: Add item from local package
ru: Добавить элемент из локального пакета

# ManualItemInstallationSettingsCard.Description
source: Select a local pack to install it. Do it ONLY if you don't have access to Online Store and you trust pack's author
ru: Выберите локальный пакет для добавления в приложение. Делайте это ТОЛЬКО в том случае, если у вас нет доступа к Онлайн-Магазину и вы доверяете автору пакета

# SelectPackTextBlock.Text
source: Select a pack file
ru: Выберите пакет

# LocalItemInstallingWarningContentDialog.Title
source: Are you sure you want to continue?
ru: Вы уверены, что хотите продолжить?

# LocalItemInstallingWarningContentDialog.PrimaryButtonText
source: No
ru: Нет

# LocalItemInstallingWarningContentDialog.SecondaryButtonText
source: Continue anyway
ru: Все равно продолжить

# ItemLocalInstallingWarningTextBlock.Text
source: Disclaimer Installing packs from unknown source can potentially harm you computer. DO NOT install packs from source you don't trust.
ru: Разработчик не несет ответственности за вред, который может нанести элемент установленный из неизвестного источника. НИ В КОЕМ СЛУЧАЕ не устанавливайте пакеты из источников, которым вы не доверяете.

# SelectLocalPackToInstall
source: Select item package...
ru: Выберите пакет для установки...

# SignedPack
source: Signed Store item package
ru: Подписанный пакет элемента для Магазина

# ConfigPack
source: Unsigned config pack
ru: Неподписанный пакет пресетов

# Patch
source: Application patch
ru: Пакет обновлений для приложения

# AllSupported
source: All supported file extentions
ru: Все поддерживаемые типы файлов

# SelectVersionControlSettingsCard.Header
source: Preferred version control type
ru: Средство контроля версий

# SelectVersionControlSettingsCardDescriptionTextBlock.Text
source: Changing this setting will affect the preferred server for receiving updates for items and applications.
ru: Изменение этого параметра повлияет на предпочитаемый сервер получения обновлений для элементов и приложения.

# AppRestartNeededTextBlock.Text
source: Please restart the application for this change to take effect.
ru: Перезапустите приложение, чтобы это изменение вступило в силу

# MemoryManagentSettingsCard.Header
source: Memory usage
ru: Использование памяти

# MemoryManagentSettingsCard.Description
source: Remove unused configs from config kits. Remove temp files. View disk usage
ru: Удаление неиспользуемых пресетов из наборов. Удаление временных файлов. Просмотр использования диска

# ItemViewAdvancedInfoButton.ToolTipService.ToolTip
source: View advanced information for debugging
ru: Показать расширенную информацию об элементе

# StoreIdTextBlock.Text
source: Store Id
ru: Уникальный идентификатор

# ItemAdvancedInfoFlyoutTitleTextBlock.Text
source: Advanced info
ru: Расширенная информация

# ItemUnsupportedWarningTextBlock.Text
source: This item is currently unsupported. Make sure your application is up to date.
ru: Этот элемент на данный момент не поддерживается. Убедитесь, что приложение обновлено до последней версии.

# DiskUsageTextBlock.Text
source: Memory usage
ru: Использование памяти

# MemoryUsageCategoryApplicationDisplayName
source: Application internal files
ru: Внутренние файлы приложения

# MemoryUsageCategoryApplicationDescription
source: These files ensure the correct functioning of the application
ru: Эти файлы обеспечивают правильную работу приложения

# UsedMemory
source: Used {0}
ru: Использовано {0}

# FreeMemory
source: Left: {0}
ru: Осталось: {0}

# MemoryUsageCategorySettingsDisplayName
source: Application settings
ru: Настройки приложения

# MemoryUsageCategorySettingsDescription
source: This files contains your settings
ru: Эти файлы содержат ваши настройки

# MemoryUsageCategoryLogsDisplayName
source: Application logs
ru: Файлы журналов

# MemoryUsageCategoryLogsDescription
source: Files for application debugging
ru: Файлы предназначенные для устранения ошибок приложения

# MemoryUsageCategoryTempDisplayName
source: Temporary files
ru: Временные файлы

# MemoryUsageCategoryTempDescription
source: Unused files
ru: Неиспользуемые файлы

# MemoryUsageCategoryStoreItemsDisplayName
source: Installed items
ru: Установленные элементы

# MemoryUsageCategoryStoreItemsDescription
source: Items you installed from the Store
ru: Элементы, которые вы установили из Магазина

# MemoryUsageCategoryStoreCacheDisplayName
source: Store cache
ru: Кэш Магазина

# MemoryUsageCategoryStoreCacheDescription
source: These files allow you to save Internet traffic
ru: Эти файлы позволяют экономить Интернет-трафик при использовании Магазина

source: Settings
ru: Параметры

source: Memory usage
ru: Использование памяти

# MemoryViewApplicationFilesDetails
source: Application internal files
ru: Внутренние файлы приложения

# ApplicationInternalFilesFullDescriptionTextBlock.Text
source: This files is required to correct application work. It's contains dynamic load libraries (DLL), localization files and other. Without this files application will not work.
ru: Эти файлы необходимы для обеспечения корректной работы приложения. Они содержат динамические библиотеки (DLL), файлы локализации и др. Без них приложение работать не будет.

# ApplicationInternalFilesActionsTextBlock.Text
source: Here you can review application installation folder.
ru: Здесь вы можете посмотреть директорию установки приложения.

# ViewAppDirButton.Content
source: View application directory
ru: Просмотр директории приложения

# ViewLogDirButton.Content
source: View logs directory
ru: Просмотр журналов

# LogFilesActionsTextBlock.Text
source: Here you can review log files
ru: Здесь вы можете изучить созданные приложением журналы

# LogFilesFullDescriptionTextBlock.Text
source: Files for application debugging. These files may help you fix some issues with this app. Also, bug reports with logs are being considered faster.
ru: Файлы предназначенные для устранения ошибок приложения. Эти файлы могут помочь вам исправить некоторые проблемы с этим приложением. Кроме того, сообщения об ошибках с прикрепленными журналами рассматриваются быстрее.

# MemoryViewLogsDetails
source: Application logs
ru: Файлы журналов

# CleanupTextBlock.Text
source: Cleanup
ru: Очистка

# CleanupLogFilesTextBlock.Text
source: Remove all application logs for cleanup disk space.
ru: Здесь можно удалить все журналы приложения для очистки места на диске.

# CleanupDirButton.Content
source: Remove
ru: Удалить

# ErrorHappensWhileCleanup
source: Something went wrong when we try to clean this files. Here is error code, in case you need it: {0}
ru: Что-то пошло не так, когда мы пытались выполнить очистку. Вот код ошибки, если он вам нужен: {0}

# MemoryViewStoreCacheFilesDetails
source: Store cache
ru: Кэш Магазина

# StoreCacheFilesFullDescriptionTextBlock.Text
source: These files allow you to save Internet traffic.
ru: Эти файлы позволяют экономить Интернет-трафик при просмотре контента в Магазине.

# CleanupStoreCacheFilesTextBlock.Text
source: If you clean Store cache all database will be downloaded again, when you start browsing Store.
ru: Если вы очистите кэш Магазина, вся база данных будет загружена заново при следующем запуске Магазина.

# StoreInstalledItemsFullDescriptionTextBlock.Text
source: All items you installed from the Store or another source.
ru: Все элементы, которые вы установили из Магазина или других источников.

# SetupMenuFlyuoutItem.Text
source: Setup
ru: Перейти к настройкам

# MemoryViewInstalledItemsDetails
source: Installed items
ru: Установленные элементы

# MemoryViewSettingsDetails
source: Application settings
ru: Настройки приложения

# ApplicationSettingsFullDescriptionTextBlock.Text
source: These files contains your settings like windows positions, theme, preferred version control type and etc.
ru: Эти файлы содержат ваши настройки, например положения окон на рабочем столе, предпочитаемый сервер для получения обновлений и другие.

# ResetSettingsTextBlock.Text
source: Remove all settings, then restart application. This will not appears to items you installed.
ru: Удалить все настройки, затем перезапустить приложение. Установленные элементы удалены не будут.

# ResetButton.Content
source: Reset
ru: Сброс

# ResetSettingsAskTextBlock.Text
source: This action remove ALL you settings. Continue anyway?
ru: Это действие удалит ВСЕ ваши настройки. Продолжить в любом случае?

# ContinueAnywayButton.Content
source: Continue anyway
ru: Все равно продолжить

source: Local Drive
ru: Локальный диск

# EditConfigKitMenuItem.Text
source: Edit config kit
ru: Изменить набор пресетов

# UsedSiteListsText
source: Used site lists: {0} and {1} more.
ru: Используемые списки сайтов: {0} и ещё {1}.

# UsedSiteListText
source: Used site list: {0}.
ru: Используемый список сайтов: {0}.

# NoUsedSiteListText
source: No site lists used.
ru: Списки сайтов не используются.

# ExcludedSiteListsText
source: Excluded site lists: {0} and {1} more.
ru: Списки исключений: {0} и ещё {1}.

# ExcludedSiteListText
source: Excluded site list: {0}.
ru: Список исключений: {0}.

# NoExcludedSiteListText
source: No exclude site list used.
ru: Списки исключений не используются.

# LastEditTimeText
source: Last edit: {0}
ru: Последнее изменение: {0}

# RenameButton.ToolTipService.ToolTip
source: Rename
ru: Переименовать

# EditButton.ToolTipService.ToolTip
source: Edit config
ru: Изменить пресет

# ViewUsedDirectoriesButton.ToolTipService.ToolTip
source: View used files
ru: Показать используемые файлы

# RenameTitleTextBlock.Text
source: Rename config
ru: Переименовать пресет

# ApplyRenameButton.Content
source: Rename
ru: Переименовать

# CannotSaveConfigMessage
source: We can't save your config during unexpected exception. Make sure program has 'write' access for Store directory. Here is error code in case you need it: {0}
ru: Мы не смогли сохранить этот пресет из-за неожиданного исключения. Убедитесь, что у программы есть права типа 'write' для директории Магазина. Ниже расположен код исключения, если он вам нужен. {0}

source: Something went wrong
ru: Что-то пошло не так

# SaveConfigException
source: We cannot save this kit during unexcepted exception. Here is error code in case you need it. {0}
ru: Мы не смогли сохранить этот набор. Ниже расположен код исключения, если он вам нужен. {0}

# SaveConfigKitAsContentDialog.Title
source: Save config kit as...
ru: Сохранить набор как...

# SaveForMeSelectorBarItem.Text
source: Save as new kit for myself
ru: Сохранить как новый набор для себя

# SaveForDistributeSelectorBarItem.Text
source: Save as distributed kit
ru: Сохранить как распространяемый набор

# ImageTextBlock.Text
source: Icon
ru: Иконка

# EditAccentTextBlock.Text
source: Edit accent
ru: Акцент

# IdTextBlock.Text
source: Id*
ru: Идентификатор*

# GenerateNewIdButton.ToolTipService.ToolTip
source: Generate new id
ru: Создать новый идентификатор

# VersionTextBlock.Text
source: Version*
ru: Версия*

# EditImageButton.ToolTipService.ToolTip
source: Edit image
ru: Изменить изображение

source: Choose an image
ru: Выберите изображение

# SelectConfigKitToEditContentDialog.Title
source: Edit config kit
ru: Изменить набор пресетов

# SelectConfigKitToEditContentDialog.SecondaryButtonText
source: Cancel
ru: Отмена

# FrameGoBackButton.ToolTipService.ToolTIp
source: Back
ru: Назад

# CancelTextBlock.Text
source: Cancel
ru: Отмена

source: Ready
ru: Готово

# LoadingConfigs
source: Loading config list...
ru: Загрузка списка пресетов...

# SavingConfigKit
source: Exporting config kit...
ru: Выполняется экспорт набора пресетов...

# YesButton.Content
source: Yes
ru: Да

# SaveConfirmation.Text
source: This action will rewrite entire config kit. Also, if you update or reinstall it from Store all changes may be lost. To keep your data safe, create new kit instead.
ru: Это действие перезапишет весь набор пресетов. Кроме того, если вы обновите или переустановите его из Магазина, все изменения могут быть потеряны. Чтобы сохранить ваши настройки в безопасности, создайте новый набор.

# StoreSmallUpdateItemName
source: Update {0}?
ru: Обновить {0}?

# OpenStoreSettingsCard.Header
source: Components Store settings
ru: Параметры Магазина компонентов

# OpenStoreSettingsCard.Description
source: Memory usage. Preferred version control. Local item installing
ru: Использование памяти. Предпочитаемый сервер для обновлений. Установка локального элемента

# NoUpdatesAvailableRightNowTextBlock.Text
source: There is no updates available right now. You can check updates manually, if you want.
ru: Сейчас нет доступных обновлений. Однако, они могут появится, если вы проведете ручную проверку ещё раз.

# PathViewModeMenuItem.Text
source: File paths
ru: Пути к файлам

# ShowPathsMenuItem.Text
source: Full
ru: Полные

# HidePathsMenuItem.Text
source: Only file names
ru: Только названия файлов

# LogsTextBlock.Text
source: Logs&Performance
ru: Отладка + Производительность

# DataCentersTextBlock.Text
source: Telegram data centers
ru: Датацентры Telegram

# AddTextBlock.Text
source: Add
ru: Добавить

# PasteFromBufferTextBlock.Text
source: Paste from clipboard
ru: Добавить из буфера обмена

# ShareTextBlock.Text
source: Share
ru: Поделиться

# NumberTextBlock.Text
source: Number
ru: Номер

# IpTextBlock.Text
source: IP address
ru: IP-адрес

# TgWsDataCenterEditContentDialog.PrimaryButtonText
source: Save
ru: Сохранить

# TgWsDataCenterEditContentDialog.SecondaryButtonText
source: Cancel
ru: Отмена

# AddDataCenter
source: Add new rule
ru: Добавить новое правило

# EditDataCenter
source: Edit rule
ru: Изменить правило

# PasteComplete
source: Supported content is pasted
ru: Поддерживаемый контент вставлен

# PasteFailure
source: Content you pasted is unsupported
ru: Контент не поддерживается

# CopyComplete
source: Text copied to clipboard
ru: Текст скопирован в буфер обмена

# AdvancedLoggingSettingsExpander.Header
source: Detailed logging (verbose)
ru: Подробное ведение журнала (verbose)

# AdvancedLoggingSettingsExpander.Description
source: Write more information in log file. It's may help with troubleshooting.
ru: Записывать в отладочный журнал больше информации. Это может помочь при устранении неполадок, но повышает нагрузку.

# BufferSettingsCard.Header
source: Buffer size (KB)
ru: Размер буфера (Кб)

# BufferSettingsCard.Description
source: The size of the receive/transmit buffer in kilobytes. The larger the value, the more memory will be allocated to the socket.
ru: Размер буфера приёма/передачи в килобайтах. Чем больше значение, тем больше памяти будет выделено на сокет.

# WebSocketSettingsCard.Header
source: WebSocket sessions pool
ru: Пул WebSocket-сессий

# WebSocketSettingsCard.Description
source: How many parallel WebSocket sessions can be supported simultaneously to a single data center. Increasing this number can help under high load.
ru: Сколько параллельных WebSocket-сессий к одному датацентру можно одновременно держать. Увеличение может помочь при высокой нагрузке.

# LogSizeSettingsCard.Header
source: Maximum size of log file (MB)
ru: Максимальный размер файла журнала (Мб)

# LogSizeSettingsCard.Description
source: When the specified limit is reached, the file will be overwritten.
ru: При достижении указанного лимита файл будет перезаписан.

# LogsPerformanceSettingsExpander.Header
source: Logs&Performance
ru: Отладка и производительность

# DefaultConfigPlaceholder
source: Default Config
ru: Стандартный

# GoToComponentSettings.Content
source: Go to settings page
ru: Перейти к настройкам компонента

# LinkedSettingsTextBlock.Text
source: Linked settings
ru: Связанные параметры

# CreateNewConfigForComponentContentDialog.Title
source: Create new config
ru: Создать новый пресет

# CreateNewConfigForComponentContentDialog.SecondaryButtonText
source: Cancel
ru: Отмена

# CreateFromTemplateTextBlock.Text
source: Use recommended template
ru: Использовать рекомендуемый образец

# CreateManuallyTextBlock.Text
source: From scratch
ru: Создать с нуля

# ConnectTelegramProxyContentDialog.Title
source: Connect Telegram to proxy
ru: Подключить Telegram к прокси

# ConnectTelegramProxyContentDialog.SecondaryButtonText
source: Cancel
ru: Отмена

# ConnectManuallyTextBlock.Text
source: Connect manually
ru: Подключить вручную

# ConnectViaLinkTextBlock.Text
source: Connect via link
ru: Подключить при помощи ссылки

# CopyButton.CopiedMessage
source: Copied to clipboard.
ru: Скопировано в буфер обмена.

# KeyTextBlock.Text
source: Secret key
ru: Ключ

# ConnectTgWsProxy
source: Connect Telegram to proxy
ru: Подключить Telegram к прокси

# AutoSelectionNotAvailableTextBlock.Text
source: Auto selection is not available for this component. You must create config manually or use templates.
ru: Автоподбор не доступен для этого компонента. Вам необходимо создать пресет вручную или использовать существующий образец.

# ConfigsForComponentNotFound.Text
source: We can't found any configs for this component.
ru: Для этого компонента нет установленных пресетов.

# NothingToShowTextBlock.Text
source: No items match the specified filters.
ru: Ни один элемент не соответствует указанным фильтрам.

source: Reading report results...
ru: Чтение результатов подбора...

# ShowAnywayButton.Content
source: Show this content anyway
ru: Отобразить содержимое

# ViewAppliedFlagsForSiteListButton.Text
source: View applied params
ru: Показать применяемые флаги запуска

# ViewInFolderButton
source: View in folder
ru: Показать в папке

# ViewMoreActionsToolTip
source: View more actions
ru: Показать больше действий

# QHyperlinkButton.ToolTipService.ToolTip
source: 🦊 Fox ~
ru: 🦊 Лиса ~

# QContentDialog.SecondaryButtonText
source: Close
ru: Далеко

# ChangeSiteList
source: Replace site list
ru: Заменить список сайтов

# ChangeListContentDialogTitle
source: Replace {0}
ru: Заменить {0}

# XChangeListContentDialog.SecondaryButtonText
source: Cancel
ru: Отмена

# XChangeListContentDialog.PrimaryButtonText
source: Apply
ru: Применить

# ChangeListTipTextBlock.Text
source: Replace this list with another list you want. This change appears only for yourself. If you want share this kit with others, make changes in config manually.
ru: Замените этот список сайтов другим. Это изменение будет применено только для вас. Если вы хотите поделиться этим набором, то внесите изменения вручную.

# FromTheStoreTextBlock.Text
source: From the Store
ru: Из Магазина

# ManuallyTextBlock.Text
source: Manually
ru: Вручную

# SelectFileTipTextBlock.Text
source: Select file on this PC
ru: Выбрать файл для замены на этом ПК

# FindNewItemsInStoreTextBlock.Text
source: Find new items in Store
ru: Найти подходящие элементы в Магазине

# NoContentToDisplay
source: There is no content to display for.
ru: Здесь нет контента, который можно отобразить.

# NoSuitableStoreItemsFound.Text
source: No suitable items found in you Store library. Try to install new items or select manual method.
ru: Подходящие элементы не найдены среди установленных из Магазина. Попробуйте установить новые поддерживаемые элементы или выберите ручной способ.

# YouDontAddAnyFilesYet.Text
source: You don't add any files yet. Add new file by clicking to button.
ru: Вы еще не добавляли собственные файлы. Чтобы добавить новый файл нажмите на кнопку ниже.

# RevertChangeSiteList
source: Restore original file
ru: Восстановить оригинальный файл
